In [1]:
import pandas as pd

In [5]:
import pandas as pd
print(pd.__version__)

2.2.2

# Data Eploration & Loading

In [2]:
df = pd.read_csv('Walmart.csv')

In [3]:
df

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48
...,...,...,...,...,...,...,...,...,...,...,...
10046,9996,WALM056,Rowlett,Fashion accessories,$37,3.0,03/08/23,10:10:00,Cash,3.0,0.33
10047,9997,WALM030,Richardson,Home and lifestyle,$58,2.0,22/02/21,14:20:00,Cash,7.0,0.48
10048,9998,WALM050,Victoria,Fashion accessories,$52,3.0,15/06/23,16:00:00,Credit card,4.0,0.48
10049,9999,WALM032,Tyler,Home and lifestyle,$79,2.0,25/02/21,12:25:00,Cash,7.0,0.48
10050,10000,WALM069,Rockwall,Fashion accessories,$62,3.0,26/09/20,9:48:00,Cash,3.0,0.33

In [6]:
df.shape

(10051, 11)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [10]:
df.describe()        # quantity column has some missing values and also its data type is not proper

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [9]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
10046     True
10047     True
10048     True
10049     True
10050     True
Length: 10051, dtype: bool

In [11]:
df.duplicated().sum()

51

# remove duplicates

In [14]:
df.drop_duplicates(inplace=True)

In [15]:
df.duplicated().sum()

0

In [19]:
df.shape   # erier it could be 10051

(10000, 11)

# deals with null values

In [20]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [21]:
df.describe()

        invoice_id     quantity        rating  profit_margin
count  10000.00000  9969.000000  10000.000000   10000.000000
mean    5000.50000     2.355602      5.830170       0.393813
std     2886.89568     1.605455      1.764097       0.090656
min        1.00000     1.000000      3.000000       0.180000
25%     2500.75000     1.000000      4.000000       0.330000
50%     5000.50000     2.000000      6.000000       0.330000
75%     7500.25000     3.000000      7.000000       0.480000
max    10000.00000    10.000000     10.000000       0.570000

# replace null value of quantity column by its mean value which is 2.35

before replacing null values first fill it by 0

In [25]:
df.fillna(0, inplace = True)

In [26]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [29]:
df['quantity'].replace(0,2.35, inplace=True)

C:\Users\dell\AppData\Local\Temp\ipykernel_708\3562360679.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['quantity'].replace(0,2.35, inplace=True)

In [30]:
df['quantity']

0       7.0
1       5.0
2       7.0
3       8.0
4       7.0
       ...
9995    3.0
9996    2.0
9997    3.0
9998    2.0
9999    3.0
Name: quantity, Length: 10000, dtype: float64

In [31]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [32]:
df.shape

(10000, 11)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10000 non-null  int64
 1   Branch          10000 non-null  object
 2   City            10000 non-null  object
 3   category        10000 non-null  object
 4   unit_price      10000 non-null  object
 5   quantity        10000 non-null  float64
 6   date            10000 non-null  object
 7   time            10000 non-null  object
 8   payment_method  10000 non-null  object
 9   rating          10000 non-null  float64
 10  profit_margin   10000 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 937.5+ KB

# change data type of unit_price column

In [35]:
df['unit_price']= df['unit_price'].astype(float)     # it occur error, so first remove dollar sign

ValueError: could not convert string to float: '$74.69'

# first remove dollar sign, then chage data type

In [41]:
df['unit_price'].str.replace('$', '', regex = True).astype(float)

ValueError: could not convert string to float: '$74.69'

In [39]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [42]:
df['unit_price'] = pd.to_numeric(df['unit_price'].str.replace(r'[^0-9.]', '', regex=True))

In [43]:
df

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,WALM056,Rowlett,Fashion accessories,37.00,3.0,03/08/23,10:10:00,Cash,3.0,0.33
9996,9997,WALM030,Richardson,Home and lifestyle,58.00,2.0,22/02/21,14:20:00,Cash,7.0,0.48
9997,9998,WALM050,Victoria,Fashion accessories,52.00,3.0,15/06/23,16:00:00,Credit card,4.0,0.48
9998,9999,WALM032,Tyler,Home and lifestyle,79.00,2.0,25/02/21,12:25:00,Cash,7.0,0.48
9999,10000,WALM069,Rockwall,Fashion accessories,62.00,3.0,26/09/20,9:48:00,Cash,3.0,0.33

In [44]:
df['unit_price'].astype

<bound method NDFrame.astype of 0       74.69
1       15.28
2       46.33
3       58.22
4       86.31
        ...
9995    37.00
9996    58.00
9997    52.00
9998    79.00
9999    62.00
Name: unit_price, Length: 10000, dtype: float64>

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10000 non-null  int64
 1   Branch          10000 non-null  object
 2   City            10000 non-null  object
 3   category        10000 non-null  object
 4   unit_price      9969 non-null   float64
 5   quantity        10000 non-null  float64
 6   date            10000 non-null  object
 7   time            10000 non-null  object
 8   payment_method  10000 non-null  object
 9   rating          10000 non-null  float64
 10  profit_margin   10000 non-null  float64
dtypes: float64(4), int64(1), object(6)
memory usage: 937.5+ KB

In [47]:
df['unit_price'].isnull().sum()

31

In [48]:
df.describe()

        invoice_id   unit_price      quantity        rating  profit_margin
count  10000.00000  9969.000000  10000.000000  10000.000000   10000.000000
mean    5000.50000    50.622142      2.355585      5.830170       0.393813
std     2886.89568    21.203766      1.602965      1.764097       0.090656
min        1.00000    10.080000      1.000000      3.000000       0.180000
25%     2500.75000    32.000000      1.000000      4.000000       0.330000
50%     5000.50000    51.000000      2.000000      6.000000       0.330000
75%     7500.25000    69.000000      3.000000      7.000000       0.480000
max    10000.00000    99.960000     10.000000     10.000000       0.570000

# fill na by 0, then replace 0 by its mean value(50.6)

In [49]:
df['unit_price'].fillna(0,inplace = True)

In [50]:
df['unit_price'].isnull().sum()

0

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10000 non-null  int64
 1   Branch          10000 non-null  object
 2   City            10000 non-null  object
 3   category        10000 non-null  object
 4   unit_price      10000 non-null  float64
 5   quantity        10000 non-null  float64
 6   date            10000 non-null  object
 7   time            10000 non-null  object
 8   payment_method  10000 non-null  object
 9   rating          10000 non-null  float64
 10  profit_margin   10000 non-null  float64
dtypes: float64(4), int64(1), object(6)
memory usage: 937.5+ KB

# replace 0 by its avg value(50.6)

In [52]:
df['unit_price'].replace(0,50.6, inplace = True)

In [53]:
df.describe()

        invoice_id    unit_price      quantity        rating  profit_margin
count  10000.00000  10000.000000  10000.000000  10000.000000   10000.000000
mean    5000.50000     50.622073      2.355585      5.830170       0.393813
std     2886.89568     21.170872      1.602965      1.764097       0.090656
min        1.00000     10.080000      1.000000      3.000000       0.180000
25%     2500.75000     32.425000      1.000000      4.000000       0.330000
50%     5000.50000     51.000000      2.000000      6.000000       0.330000
75%     7500.25000     68.710000      3.000000      7.000000       0.480000
max    10000.00000     99.960000     10.000000     10.000000       0.570000

# add columns

In [54]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [55]:
# add column
df['total_revenue'] = df['unit_price']*df['quantity']

in pandas columns of 1st latter are in upper case, it must be lower case in SQL, so convert it in lower case

In [8]:
df.columns = df.columns.str.lower()    # conver upper case to lower

In [9]:
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin',
       'total_revenue'],
      dtype='object')

In [56]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total_revenue
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

# Export pandas dataframe to postgreSQL

In [57]:
pip install psycopg2

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Collecting psycopg2
  Downloading psycopg2-2.9.10-cp312-cp312-win_amd64.whl.metadata (5.0 kB)
Downloading psycopg2-2.9.10-cp312-cp312-win_amd64.whl (1.2 MB)
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   --------- ------------------------------ 0.3/1.2 MB ? eta -:--:--
   --------- ------------------------------ 0.3/1.2 MB ? eta -:--:--
   --------- ------------------------------ 0.3/1.2 MB ? eta -:--:--
   --------- ------------------------------ 0.3/1.2 MB ? eta -:--:--
   --------- ------------------------------ 0.3/1.2 MB ? eta -:--:--
   ------------------ --------------------- 0.5/1.2 MB 258.0 kB/s eta 0:00:03
   ------------------ --------------------- 0.5/1.2 MB 258.0 kB/s eta 0:00:03
   ------------------ --------------------- 0.5/1.2 MB 258.0 kB/s eta 0:00:03
   ------------------ --------------------- 0.5/1.2 MB 258.0 kB/s eta 0:00:03
   ------------------ --------------------- 0.5/1.2 MB 258.0 kB/s eta 0:00:03
   --------------------------- ------------ 0.8/1.2 MB 274.9 kB/s eta 0:00:02
   --------------------------- ------------ 0.8/1.2 MB 274.9 kB/s eta 0:00:02
   --------------------------- ------------ 0.8/1.2 MB 274.9 kB/s eta 0:00:02
   --------------------------- ------------ 0.8/1.2 MB 274.9 kB/s eta 0:00:02
   ------------------------------------ --- 1.0/1.2 MB 279.6 kB/s eta 0:00:01
   ------------------------------------ --- 1.0/1.2 MB 279.6 kB/s eta 0:00:01
   ---------------------------------------- 1.2/1.2 MB 284.3 kB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.10

# connection

In [11]:
from sqlalchemy import create_engine

engine_psql = create_engine("postgresql+psycopg2://postgres:038623@localhost:5432/walmart_db")

In [12]:
try:
    engine_psql
    print("connection successed to PSQL")
except:
    print("unable to connect")

connection successed to PSQL

In [13]:
# Export DataFrame to PostgreSQL

df.to_sql("walmart_db", engine_psql, if_exists='replace', index=False)

1000

# or to save pandas dataframe to csv

In [77]:
df.to_csv("Walmart.csv", index=False)

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('Walmart.csv')

In [5]:
df.shape

(10000, 12)